In [12]:
import pandas as pd

In [13]:
df = pd.read_csv("missing_data.csv")

In [14]:
df.isnull().sum()

ID      0
Name    2
Age     6
City    4
dtype: int64

In [15]:
df.shape

(20, 4)

In [16]:
df = df.dropna()

In [17]:
df.shape

(8, 4)

In [18]:
df

    ID            Name   Age           City
0    1        John Doe  25.0       New York
3    4     Alice Brown  22.0        Chicago
4    5     Chris Davis  28.0  San Francisco
8    9     Sarah Black  27.0        Seattle
11  12     Ryan Wilson  24.0         Denver
13  14     Kevin Brown  29.0        Phoenix
16  17  William Harris  37.0   Philadelphia
19  20    Emma Roberts  23.0      San Diego